zephyrproject-rtos/zephyr/subsys/bluetooth/controller/ll_sw/nordic/hal/nrf5/cntr.c
/*
 * Copyright (c) 2016 Nordic Semiconductor ASA
 * Copyright (c) 2016 Vinayak Kariappa Chettimada
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <hal/nrf_rtc.h>

#if defined(CONFIG_SOC_SERIES_NRF53X)
#include <hal/nrf_ipc.h>
#endif /* CONFIG_SOC_SERIES_NRF53X */

#include "hal/cntr.h"

#include "hal/debug.h"

#ifndef NRF_RTC
#define NRF_RTC NRF_RTC0
#endif

static uint8_t _refcount;

void cntr_init(void)
{
	NRF_RTC->PRESCALER = 0;
	nrf_rtc_event_enable(NRF_RTC, RTC_EVTENSET_COMPARE0_Msk);
	nrf_rtc_int_enable(NRF_RTC, RTC_INTENSET_COMPARE0_Msk);
}

uint32_t cntr_start(void)
{
	if (_refcount++) {
		return 1;
	}

	nrf_rtc_task_trigger(NRF_RTC, NRF_RTC_TASK_START);

#if defined(CONFIG_SOC_SERIES_NRF53X)
	nrf_ipc_task_trigger(NRF_IPC, NRF_IPC_TASK_SEND_4);
#endif /* CONFIG_SOC_SERIES_NRF53X */

	return 0;
}

uint32_t cntr_stop(void)
{
	LL_ASSERT(_refcount);

	if (--_refcount) {
		return 1;
	}

	nrf_rtc_task_trigger(NRF_RTC, NRF_RTC_TASK_STOP);

#if defined(CONFIG_SOC_SERIES_NRF53X)
	nrf_ipc_task_trigger(NRF_IPC, NRF_IPC_TASK_SEND_5);
#endif /* CONFIG_SOC_SERIES_NRF53X */

	return 0;
}

uint32_t cntr_cnt_get(void)
{
	return nrf_rtc_counter_get(NRF_RTC);
}

void cntr_cmp_set(uint8_t cmp, uint32_t value)
{
	nrf_rtc_cc_set(NRF_RTC, cmp, value);
}
